In [1]:
import pandas as pd
import numpy as np

In [5]:
arr1 = np.random.randn(3,4)
arr2 = np.array(['A','B','C'])
arr3 = np.array(['W','X','Y','Z'])

In [38]:
df = pd.DataFrame(data = arr1, index = arr2, columns = arr3)

In [39]:
df

          W         X         Y         Z
A -0.203418 -2.066101 -0.084328  0.688451
B -0.209578 -0.702794  0.718812 -0.447426
C -0.418740 -0.351658 -0.189521  0.058696

In [11]:
# Applying the index variable
# LOC = Location
# ILOC = Index Location
#for row values
df.iloc[0]

W   -0.203418
X   -2.066101
Y   -0.084328
Z    0.688451
Name: A, dtype: float64

In [12]:
# Applying the string variable
df.loc['A']

W   -0.203418
X   -2.066101
Y   -0.084328
Z    0.688451
Name: A, dtype: float64

In [13]:
df

          W         X         Y         Z
A -0.203418 -2.066101 -0.084328  0.688451
B -0.209578 -0.702794  0.718812 -0.447426
C -0.418740 -0.351658 -0.189521  0.058696

In [19]:
#Get Column Values
new = df['X']
new

A   -2.066101
B   -0.702794
C   -0.351658
Name: X, dtype: float64

In [36]:
B = df['W']
B

A   -0.203418
B   -0.209578
C   -0.418740
Name: W, dtype: float64

In [20]:
df

          W         X         Y         Z
A -0.203418 -2.066101 -0.084328  0.688451
B -0.209578 -0.702794  0.718812 -0.447426
C -0.418740 -0.351658 -0.189521  0.058696

In [21]:
df['Q'] = df['W']*df['X']

In [22]:
df

          W         X         Y         Z         Q
A -0.203418 -2.066101 -0.084328  0.688451  0.420282
B -0.209578 -0.702794  0.718812 -0.447426  0.147290
C -0.418740 -0.351658 -0.189521  0.058696  0.147253

In [23]:
pre = np.array([1,2,3])

In [24]:
df['precious'] = pre

In [26]:
df

          W         X         Y         Z         Q  precious
A -0.203418 -2.066101 -0.084328  0.688451  0.420282         1
B -0.209578 -0.702794  0.718812 -0.447426  0.147290         2
C -0.418740 -0.351658 -0.189521  0.058696  0.147253         3

In [27]:
#Deleting a Value
df.drop(['precious'], axis=1)

          W         X         Y         Z         Q
A -0.203418 -2.066101 -0.084328  0.688451  0.420282
B -0.209578 -0.702794  0.718812 -0.447426  0.147290
C -0.418740 -0.351658 -0.189521  0.058696  0.147253

In [28]:
df

          W         X         Y         Z         Q  precious
A -0.203418 -2.066101 -0.084328  0.688451  0.420282         1
B -0.209578 -0.702794  0.718812 -0.447426  0.147290         2
C -0.418740 -0.351658 -0.189521  0.058696  0.147253         3

In [29]:
#delete a column
df.drop(['C'])

          W         X         Y         Z         Q  precious
A -0.203418 -2.066101 -0.084328  0.688451  0.420282         1
B -0.209578 -0.702794  0.718812 -0.447426  0.147290         2

In [31]:
#permanent delete of a cell
df.drop(['Z'], axis = 1, inplace = True)

In [32]:
df

          W         X         Y         Q  precious
A -0.203418 -2.066101 -0.084328  0.420282         1
B -0.209578 -0.702794  0.718812  0.147290         2
C -0.418740 -0.351658 -0.189521  0.147253         3

In [40]:
df

          W         X         Y         Z
A -0.203418 -2.066101 -0.084328  0.688451
B -0.209578 -0.702794  0.718812 -0.447426
C -0.418740 -0.351658 -0.189521  0.058696

# Checking for Greater than and Less Than Values

In [42]:
df>3

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False

In [45]:
df[df<0]

          W         X         Y         Z
A -0.203418 -2.066101 -0.084328       NaN
B -0.209578 -0.702794       NaN -0.447426
C -0.418740 -0.351658 -0.189521       NaN

In [46]:
df[df>0]

    W   X         Y         Z
A NaN NaN       NaN  0.688451
B NaN NaN  0.718812       NaN
C NaN NaN       NaN  0.058696